* Indexing

#+begin_src jupyter-R :session R :async yes
library(dslabs)
data(murders)
#+end_src

#+RESULTS:

** Subsetting with logicals

#+begin_src jupyter-R :session R :async yes
murder_rate <- murders$total / murders$population * 100000
#+end_src

#+RESULTS:

#+begin_src jupyter-R :session R :async yes
ind <- murder_rate < 0.71
#+end_src

#+RESULTS:

#+begin_src jupyter-R :session R :async yes
murders$state[ind]
#+end_src

#+RESULTS:
#+begin_export markdown
1. 'Hawaii'
2. 'Iowa'
3. 'New Hampshire'
4. 'North Dakota'
5. 'Vermont'
#+end_export

#+begin_src jupyter-R :session R :async yes
sum(ind)
#+end_src

#+RESULTS:
#+begin_export markdown
5
#+end_export

** Logical operators

#+begin_src jupyter-R :session R :async yes
west <- murders$region == "West"
safe <- murder_rate <= 1
#+end_src

#+RESULTS:

#+begin_src jupyter-R :session R :async yes
ind <- safe & west
murders$state[ind]
#+end_src

#+RESULTS:
#+begin_export markdown
1. 'Hawaii'
2. 'Idaho'
3. 'Oregon'
4. 'Utah'
5. 'Wyoming'
#+end_export

** =which=

#+begin_src jupyter-R :session R :async yes
ind <- which(murders$state == "California")
murder_rate[ind]
#+end_src

#+RESULTS:
#+begin_export markdown
3.37413830627813
#+end_export

** =match=

#+begin_src jupyter-R :session R :async yes
ind <- match(c("New York", "Florida", "Texas"), murders$state)
ind
#+end_src

#+RESULTS:
#+begin_export markdown
1. 33
2. 10
3. 44
#+end_export

#+begin_src jupyter-R :session R :async yes
murder_rate[ind]
#+end_src

#+RESULTS:
#+begin_export markdown
1. 2.66795994778023
2. 3.39806883024604
3. 3.20136027189849
#+end_export

#+begin_src jupyter-R :session R :async yes
c("Boston", "Dakota", "Washington") %in% murders$state
#+end_src

#+RESULTS:
#+begin_export markdown
1. FALSE
2. FALSE
3. TRUE
#+end_export

#+begin_src jupyter-R :session R :async yes
match(c("New York", "Florida", "Texas"), murders$state)
#+end_src

#+RESULTS:
#+begin_export markdown
1. 33
2. 10
3. 44
#+end_export

#+begin_src jupyter-R :session R :async yes
which(murders$state %in% c("New York", "Florida", "Texas"))
#+end_src

#+RESULTS:
#+begin_export markdown
1. 10
2. 33
3. 44
#+end_export
